In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [2]:
engine=create_engine("mssql+pyodbc://DESKTOP-NFGVTDJ\SQLEXPRESS/customersinformation?driver=ODBC+Driver+17+for+sql+server&trusted_connection=yes")

In [3]:
history='''
create table historyy (
        id int primary key,
        employeeid int,
        name varchar(100),
        email varchar(100),
        age int,
        city varchar(100),
        startdate date,
        enddate date null,
        currentin varchar(20),
    )
    '''

In [4]:
with engine.connect() as conn:
    conn.execute(text(history))
    conn.commit()

In [5]:
hist='''
    insert into historyy(id,employeeid,name,email,age,city,startdate,enddate,currentin) values 
     (1,1,'ramesh','ramesh@ex.com',14,'orissa','2018-02-23','2025-03-22','no')
    '''

In [6]:
with engine.connect() as conn:
    conn.execute(text(hist))
    conn.commit()

In [7]:
ab='''
drop table if exists current_info;
create table  current_info(
        id int primary key,
        employeeid int,
        name varchar(100),
        email varchar(100),
        age int,
        city varchar(100),
        startdate date,
    )
    '''

In [8]:
with engine.connect() as conn:
    conn.execute(text(ab))
    conn.commit()

In [9]:
ba='''
    insert into current_info(id,employeeid,name,email,age,city,startdate) values 
     (1,1,'ramesh','ramesh@ex.com',14,'hyderabad','2025-02-23'),
     (2,2,'ramu','ramu@ex.com',20,'mumbai','2023-02-22'),
     (3,3,'raghu','raghu@ex.com',25,'sagar','2023-02-22'),
     (4,4,'rahul','rahul@ex.com',26,'srinagar','2023-02-22'),
     (5,5,'ram','ram@ex.com',27,'jammu','2023-02-22')
    '''

In [10]:
with engine.connect() as conn:
    conn.execute(text(ba))
    conn.commit()

In [11]:
pd.read_sql('select * from current_info',engine)

   id  employeeid    name          email  age       city   startdate
0   1           1  ramesh  ramesh@ex.com   14  hyderabad  2025-02-23
1   2           2    ramu    ramu@ex.com   20     mumbai  2023-02-22
2   3           3   raghu   raghu@ex.com   25      sagar  2023-02-22
3   4           4   rahul   rahul@ex.com   26   srinagar  2023-02-22
4   5           5     ram     ram@ex.com   27      jammu  2023-02-22

In [12]:
pd.read_sql('select * from historyy',engine)

,id,employeeid,name,email,age,city,startdate,enddate,currentin
0,1,1,ramesh,ramesh@ex.com,14,orissa,2018-02-23,2025-03-22,no